app/controllers/posts_controller.rb

  def index
    @posts = Post.order(:created_at).page(7).per(50)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 50], ["OFFSET", 300]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "123"], ["description", "123"], ["created_at", "2023-06-09 19:37:41.529709"], ["updated_at", "2023-06-09 19:37:41.529709"], ["user_id", 1]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2023-06-09 19:37:41.630233"], ["id", 1]]